# Retail Sales Analytics using Pandas

This project performs end-to-end data analysis on a real-world retail sales dataset from Kaggle using Python and Pandas.

Objectives:
- Clean and preprocess raw retail data  
- Fix missing values and incorrect data types  
- Engineer time-based features  
- Generate business insights using group-by aggregations

## Data Loading and Inspection

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('train 2.csv')
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales
0,1,CA-2017-152156,08/11/2017,11/11/2017,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600
1,2,CA-2017-152156,08/11/2017,11/11/2017,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400
2,3,CA-2017-138688,12/06/2017,16/06/2017,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,California,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200
3,4,US-2016-108966,11/10/2016,18/10/2016,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775
4,5,US-2016-108966,11/10/2016,18/10/2016,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680

In [4]:
df.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales'],
      dtype='object')

# Data Cleaning and Preprocessing

In [5]:
df.isnull().sum()

Row ID            0
Order ID          0
Order Date        0
Ship Date         0
Ship Mode         0
Customer ID       0
Customer Name     0
Segment           0
Country           0
City              0
State             0
Postal Code      11
Region            0
Product ID        0
Category          0
Sub-Category      0
Product Name      0
Sales             0
dtype: int64

In [6]:
df.dtypes

Row ID             int64
Order ID          object
Order Date        object
Ship Date         object
Ship Mode         object
Customer ID       object
Customer Name     object
Segment           object
Country           object
City              object
State             object
Postal Code      float64
Region            object
Product ID        object
Category          object
Sub-Category      object
Product Name      object
Sales            float64
dtype: object

In [7]:
df['Postal Code']=df['Postal Code'].fillna(value="Unknown")
df['Postal Code'].isnull().sum()

np.int64(0)

## Feature Engineering (Year and Month Extraction)

In [8]:
df['Order Date']=pd.to_datetime(df["Order Date"],dayfirst=True)

In [9]:
df['Ship Date']=pd.to_datetime(df['Ship Date'],dayfirst=True)

In [10]:
df.dtypes

Row ID                    int64
Order ID                 object
Order Date       datetime64[ns]
Ship Date        datetime64[ns]
Ship Mode                object
Customer ID              object
Customer Name            object
Segment                  object
Country                  object
City                     object
State                    object
Postal Code              object
Region                   object
Product ID               object
Category                 object
Sub-Category             object
Product Name             object
Sales                   float64
dtype: object

In [11]:
df["Order Year"]=df['Order Date'].dt.year
df["Order Month"]=df["Order Date"].dt.month

In [12]:
df[["Order Date", "Order Year", "Order Month"]].head()

  Order Date  Order Year  Order Month
0 2017-11-08        2017           11
1 2017-11-08        2017           11
2 2017-06-12        2017            6
3 2016-10-11        2016           10
4 2016-10-11        2016           10

# Business Insights

## Year-wise total sales

This analysis shows how total revenue changed across different years.

In [13]:
yearly_sales_df = df.groupby("Order Year")["Sales"].sum().reset_index(name="Total Sales")

In [14]:
yearly_sales_df

   Order Year  Total Sales
0        2015  479856.2081
1        2016  459436.0054
2        2017  600192.5500
3        2018  722052.0192

## Category-wise total sales

In [15]:
category_sales_df=df.groupby("Category")["Sales"].sum().reset_index(name="Total Sales category wise")
category_sales_df

          Category  Total Sales category wise
0        Furniture                728658.5757
1  Office Supplies                705422.3340
2       Technology                827455.8730

## City-wise total sales

This analysis identifies the cities that generate the highest revenue.

In [16]:
city_sales_df =df.groupby("City")["Sales"].sum().reset_index(name="Total sales").sort_values(by="Total sales",ascending=False)
city_sales_df.head(10)

              City  Total sales
327  New York City  252462.5470
265    Los Angeles  173420.1810
450        Seattle  116106.3220
436  San Francisco  109041.1200
372   Philadelphia  108841.7490
207        Houston   63956.1428
80         Chicago   47820.1330
435      San Diego   47521.0290
216   Jacksonville   44713.1830
123        Detroit   42446.9440

## Region-wise total sales + ranking

In [17]:
region_sales_df=df.groupby("Region")["Sales"].sum().reset_index(name="Total sales region wise").sort_values(by="Total sales region wise", ascending=False)

In [18]:
region_sales_df

    Region  Total sales region wise
3     West              710219.6845
1     East              669518.7260
0  Central              492646.9132
2    South              389151.4590

## Monthly sales trend (time series)

In [19]:
monthly_sales_df=df.groupby(["Order Year","Order Month"])["Sales"].sum().reset_index().sort_values(by=["Order Year","Order Month"])

In [20]:
monthly_sales_df.head(12)

    Order Year  Order Month       Sales
0         2015            1  14205.7070
1         2015            2   4519.8920
2         2015            3  55205.7970
3         2015            4  27906.8550
4         2015            5  23644.3030
5         2015            6  34322.9356
6         2015            7  33781.5430
7         2015            8  27117.5365
8         2015            9  81623.5268
9         2015           10  31453.3930
10        2015           11  77907.6607
11        2015           12  68167.0585

## Top 10 products by total sales

In [21]:
product_sales_df =df.groupby("Product Name")["Sales"].sum().reset_index(name="Total Sales").sort_values(by="Total Sales",ascending=False)

In [22]:
product_sales_df.head(10)

                                          Product Name  Total Sales
404              Canon imageCLASS 2200 Advanced Copier    61599.824
649  Fellowes PB500 Electric Punch Plastic Comb Bin...    27453.384
444  Cisco TelePresence System EX90 Videoconferenci...    22638.480
785       HON 5400 Series Task Chairs for Big and Tall    21870.576
685         GBC DocuBind TL300 Electric Binding System    19823.479
687   GBC Ibimaster 500 Manual ProClick Binding System    19024.500
804               Hewlett Packard LaserJet 3310 Copier    18839.686
786  HP Designjet T520 Inkjet Large Format Printer ...    18374.895
682          GBC DocuBind P400 Electric Binding System    17965.068
812        High Speed Automatic Electric Letter Opener    17030.312

# Conclusion

In this project, I analyzed a real-world retail dataset from Kaggle using Pandas.  
I cleaned missing values, fixed data types, engineered time-based features, and generated business insights.

Key insights:
- Revenue increased significantly from 2016 to 2018  
- Technology is the highest revenue-generating category  
- West and East regions outperform other regions  
- New York City and Los Angeles are the top revenue cities  

This project demonstrates practical data cleaning, analysis using Python and Pandas.